cask_args appdir: '/Applications'

# taps
tap 'caskroom/homebrew-cask' || true
tap 'homebrew/core' || true

# version control
brew 'git'
brew 'git-crypt'

# shell
brew 'bash-completion'

# languages
brew 'node'
brew 'go'
brew 'php70'
brew 'php56'

brew 'rbenv'
brew 'ruby-build'

# package managers
brew 'composer'
brew 'yarn'

# databases
brew 'mysql'
brew 'redis'
cask 'sequel-pro'

# messaging
brew 'rabbitmq'

# editors
brew 'vim'
cask 'phpstorm'
cask 'sublime-text'
cask 'visual-studio-code'

# utilities
brew 'tmux'
brew 'tree'
brew 'socat'
brew 'wget'
brew 'fzf'
brew 'watch'
brew 'ag'
brew 'jq'
brew 'grip'
brew 'direnv'
brew 'fasd'
brew 'tig'
brew 'nano'

cask 'gpg-suite'
cask 'spectacle'
cask 'skitch'
cask 'ngrok'
cask 'docker'
brew 'kubernetes-cli'

# fun
cask 'spotify'

# terminal
cask 'iterm2'

# web
cask 'google-chrome'
cask 'slack'

