cask_args appdir: '/Applications'

# taps
tap 'caskroom/homebrew-cask' || true
tap 'homebrew/homebrew-php' || true

# version control
brew 'git'

# shell
brew 'bash-completion'

# languages
brew 'node'
brew 'go'
brew 'php70'

brew 'rbenv'
brew 'ruby-build'

# package managers
brew 'composer'
brew 'yarn'

# databases
brew 'mysql'
brew 'redis'

# editors
brew 'vim'

# utilities
brew 'tmux'
brew 'tree'
brew 'socat'
brew 'wget'
brew 'fzf'
brew 'watch'
brew 'ag'
brew 'jq'
brew 'grip'
brew 'direnv'
brew 'fasd'

# Casks
cask 'iterm2'
cask 'ngrok'
cask 'phpstorm'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'spectacle'
